Revit 2027 API
SunAndShadowSettings.GetActiveSunAndShadowSettings Method
 Returns the current SunAndShadowSettings element assigned to the active view for the supplied document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Element GetActiveSunAndShadowSettings(
	Document aDocument
)
Public Shared Function GetActiveSunAndShadowSettings (
	aDocument As Document
) As Element
public:
static Element^ GetActiveSunAndShadowSettings(
	Document^ aDocument
)
static member GetActiveSunAndShadowSettings :
        aDocument : Document -> Element
Parameters
aDocument Document
 The document.
Return Value
Element
 The active SunAndShadowSettings element for the supplied document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace